# SpatialElementBoundaryOptions Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SpatialElementBoundaryOptions Members
SpatialElementBoundaryOptions Class Constructors Methods Properties See Also
---
The SpatialElementBoundaryOptions type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| SpatialElementBoundaryOptions | Constructs default options for calculation of the geometry of spatial elements (rooms, spaces). |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the SpatialElementBoundaryOptions |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| SpatialElementBoundaryLocation | The boundary of spatial element for geometry calculation. |
| StoreFreeBoundaryFaces | Indicates whether to include the free boundary faces in the result. |

# See Also
SpatialElementBoundaryOptions Class
Autodesk.Revit.DB Namespace